## 1. sort_values() method on series

### sort_values() does not modify existing series

In [ ]:
import os
import pandas as pd

os.chdir("/home/mediaworker/anaconda2/envs/pandas_playground/")

In [3]:
# read pokemon dataset from csv
pokemon = pd.read_csv("datasets/pokemon.csv")

# read google dataset from csv
google = pd.read_csv("datasets/google_stock_price.csv")

In [20]:
# sort data frame based on column label
# Column label supplied should be case sensitive
pokemon.sort_values("Type")

In [21]:
# sort data frame based on column label
# Column label supplied should be case sensitive
# Following command return top 5 rows of sorted data frame
pokemon.sort_values("Type").head()

        Pokemon Type
541    Leavanny  Bug
411       Burmy  Bug
544   Scolipede  Bug
648    Genesect  Bug
401  Kricketune  Bug

In [22]:
# sort data frame based on column label
# Column label supplied should be case sensitive
# Following command return bottom 5 rows of sorted data frame
pokemon.sort_values("Type").tail()

      Pokemon   Type
514   Panpour  Water
85       Seel  Water
86    Dewgong  Water
185  Politoed  Water
169  Chinchou  Water

In [23]:
# sort data frame descending order based on column label
# Column label supplied should be case sensitive
# Following command return bottom 5 rows of sorted data frame
pokemon.sort_values("Type", ascending=False).tail()

        Pokemon Type
544   Scolipede  Bug
312     Volbeat  Bug
313    Illumise  Bug
468     Yanmega  Bug
587  Karrablast  Bug

In [27]:
# Sort on numeric series, get top 5 rows
google.sort_values("Stock Price").head()

    Stock Price
11        49.95
9         50.07
0         50.12
10        50.70
12        50.74

In [30]:
# Sort on numeric series, get top 5 rows
# get largest stock price
google.sort_values("Stock Price", ascending=False).head(1)

      Stock Price
3011       782.22